import pytest

from src.widget import get_date, mask_account_card


@pytest.mark.parametrize(
    "bank_details, expected",
    [
        ("Maestro 1596837868705199", "Maestro 1596 83** **** 5199"),  # корректный ввод
        ("Visa Classic 6831982476737658", "Visa Classic 6831 98** **** 7658"),  # корректный ввод
        ("Счет 64686473678894779589", "Счет **9589"),  # корректный ввод
        ([], "Неверные данные карты или счета."),  # неверный тип атрибута, список вместо строки
        ("", "Не указаны данные карты или счета."),  # пустая строка
        ("Maestro 15968378687051991", "Номер карты или счета указан неверно."),  # в номере не 16 и не 20 цифр
        ("Счет abcdabcdabcdabcdabcd", "Номер карты или счета указан неверно."),  # вместо номера буквы
    ],
)
def test_mask_account_card(bank_details, expected):
    assert mask_account_card(bank_details) == expected


@pytest.mark.parametrize(
    "date, expected",
    [
        ("2024-03-11T02:26:18.671407", "11.03.2024"),  # корректный ввод
        ("2024-12-31T23:59:59.000000", "31.12.2024"),  # корректный ввод
        ("2024-03-11", "11.03.2024"),  # корректный ввод
        ("2024-02-29T23:59:59.000000", "29.02.2024"),  # корректный ввод, високосный год
        ("2023-02-29T23:59:59.000000", None),  # корректный ввод, високосный год
        ("", None),  # Дата отсутствует
    ],
)
def test_get_date(date, expected):
    assert get_date(date) == expected
